; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob9) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 depot1)
	(clear crate6)
	(at pallet2 depot2)
	(clear crate10)
	(at pallet3 distributor0)
	(clear crate9)
	(at pallet4 distributor1)
	(clear crate1)
	(at pallet5 distributor2)
	(clear crate12)
	(at pallet6 distributor2)
	(clear crate3)
	(at pallet7 distributor1)
	(clear pallet7)
	(at pallet8 depot0)
	(clear crate7)
	(at pallet9 depot2)
	(clear pallet9)
	(at pallet10 depot2)
	(clear crate11)
	(at pallet11 depot2)
	(clear pallet11)
	(at pallet12 depot0)
	(clear pallet12)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 279)
	(at truck1 depot1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 353)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 depot0)
	(available hoist11)
	(at hoist12 depot0)
	(available hoist12)
	(at hoist13 distributor2)
	(available hoist13)
	(at hoist14 distributor2)
	(available hoist14)
	(at crate0 depot0)
	(on crate0 pallet8)
	(= (weight crate0) 20)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(= (weight crate1) 2)
	(at crate2 depot0)
	(on crate2 crate0)
	(= (weight crate2) 60)
	(at crate3 distributor2)
	(on crate3 pallet6)
	(= (weight crate3) 71)
	(at crate4 depot0)
	(on crate4 pallet0)
	(= (weight crate4) 28)
	(at crate5 depot2)
	(on crate5 pallet2)
	(= (weight crate5) 51)
	(at crate6 depot1)
	(on crate6 pallet1)
	(= (weight crate6) 12)
	(at crate7 depot0)
	(on crate7 crate2)
	(= (weight crate7) 14)
	(at crate8 depot2)
	(on crate8 pallet10)
	(= (weight crate8) 10)
	(at crate9 distributor0)
	(on crate9 pallet3)
	(= (weight crate9) 73)
	(at crate10 depot2)
	(on crate10 crate5)
	(= (weight crate10) 38)
	(at crate11 depot2)
	(on crate11 crate8)
	(= (weight crate11) 65)
	(at crate12 distributor2)
	(on crate12 pallet5)
	(= (weight crate12) 20)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet12)
		(on crate1 crate0)
		(on crate2 pallet8)
		(on crate3 crate10)
		(on crate4 pallet6)
		(on crate6 pallet10)
		(on crate7 crate8)
		(on crate8 crate9)
		(on crate9 pallet0)
		(on crate10 pallet3)
		(on crate11 pallet7)
		(on crate12 pallet9)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist9 crate11 crate8 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist9) (on crate11 crate8)
   added: (lifting hoist9 crate11) (clear crate8)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 12
2. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 12
3. (lift hoist13 crate3 pallet6 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist13) (on crate3 pallet6)
   added: (lifting hoist13 crate3) (clear pallet6)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 12
4. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 12
5. (lift hoist1 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   changed: (fuel-cost) from 22 to 23
   goals met: 0 of 12
6. (lift hoist11 crate7 crate2 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist11) (on crate7 crate2)
   added: (lifting hoist11 crate7) (clear crate2)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 12
7. (load hoist11 crate7 truck1 depot0)
   deleted: (lifting hoist11 crate7)
   added: (in crate7 truck1) (available hoist11)
   changed: (current_load truck1) from 0 to 14
   goals met: 0 of 12
8. (lift hoist11 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist11) (on crate2 crate0)
   added: (lifting hoist11 crate2) (clear crate0)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 12
9. (lift hoist12 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist12) (on crate4 pallet0)
   added: (lifting hoist12 crate4) (clear pallet0)
   changed: (fuel-cost) from 25 to 26
   goals met: 0 of 12
10. (lift hoist3 crate9 pallet3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 pallet3)
   added: (lifting hoist3 crate9) (clear pallet3)
   changed: (fuel-cost) from 26 to 27
   goals met: 0 of 12
11. (load hoist13 crate3 truck0 distributor2)
   deleted: (lifting hoist13 crate3)
   added: (in crate3 truck0) (available hoist13)
   changed: (current_load truck0) from 0 to 71
   goals met: 0 of 12
12. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 27 to 37
   goals met: 0 of 12
13. (lift hoist13 crate12 pallet5 distributor2)
   deleted: (at crate12 distributor2) (clear crate12) (available hoist13) (on crate12 pallet5)
   added: (lifting hoist13 crate12) (clear pallet5)
   changed: (fuel-cost) from 37 to 38
   goals met: 0 of 12
14. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 38 to 48
   goals met: 0 of 12
15. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 48 to 58
   goals met: 0 of 12
16. (lift hoist0 crate0 pallet8 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet8)
   added: (lifting hoist0 crate0) (clear pallet8)
   changed: (fuel-cost) from 58 to 59
   goals met: 0 of 12
17. (lift hoist4 crate1 pallet4 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet4)
   added: (lifting hoist4 crate1) (clear pallet4)
   changed: (fuel-cost) from 59 to 60
   goals met: 0 of 12
18. (drop hoist0 crate0 pallet12 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet12)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet12)
   goals met: 1 of 12
19. (drop hoist11 crate2 pallet8 depot0)
   deleted: (lifting hoist11 crate2) (clear pallet8)
   added: (available hoist11) (at crate2 depot0) (clear crate2) (on crate2 pallet8)
   goals met: 2 of 12
20. (load hoist9 crate11 truck1 depot2)
   deleted: (lifting hoist9 crate11)
   added: (in crate11 truck1) (available hoist9)
   changed: (current_load truck1) from 14 to 79
   goals met: 2 of 12
21. (unload hoist2 crate3 truck0 depot2)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 71 to 0
   goals met: 2 of 12
22. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 60 to 70
   goals met: 2 of 12
23. (drop hoist2 crate3 crate10 depot2)
   deleted: (lifting hoist2 crate3) (clear crate10)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 crate10)
   goals met: 3 of 12
24. (lift hoist9 crate3 crate10 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist9) (on crate3 crate10)
   added: (lifting hoist9 crate3) (clear crate10)
   changed: (fuel-cost) from 70 to 71
   goals met: 2 of 12
25. (unload hoist6 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist6)
   added: (lifting hoist6 crate11)
   changed: (current_load truck1) from 79 to 14
   goals met: 2 of 12
26. (drop hoist6 crate11 pallet7 distributor1)
   deleted: (lifting hoist6 crate11) (clear pallet7)
   added: (available hoist6) (at crate11 distributor1) (clear crate11) (on crate11 pallet7)
   goals met: 3 of 12
27. (drop hoist9 crate3 crate10 depot2)
   deleted: (lifting hoist9 crate3) (clear crate10)
   added: (available hoist9) (at crate3 depot2) (clear crate3) (on crate3 crate10)
   goals met: 4 of 12
28. (lift hoist2 crate8 pallet10 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 pallet10)
   added: (lifting hoist2 crate8) (clear pallet10)
   changed: (fuel-cost) from 71 to 72
   goals met: 4 of 12
29. (drop hoist2 crate8 pallet11 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet11)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet11)
   goals met: 4 of 12
30. (load hoist4 crate1 truck1 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck1) (available hoist4)
   changed: (current_load truck1) from 14 to 16
   goals met: 4 of 12
31. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 72 to 82
   goals met: 4 of 12
32. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 82 to 92
   goals met: 4 of 12
33. (load hoist1 crate6 truck0 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 12
   goals met: 4 of 12
34. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 92 to 102
   goals met: 4 of 12
35. (load hoist13 crate12 truck1 distributor2)
   deleted: (lifting hoist13 crate12)
   added: (in crate12 truck1) (available hoist13)
   changed: (current_load truck1) from 16 to 36
   goals met: 4 of 12
36. (unload hoist2 crate6 truck0 depot2)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 12 to 0
   goals met: 4 of 12
37. (drop hoist2 crate6 pallet10 depot2)
   deleted: (lifting hoist2 crate6) (clear pallet10)
   added: (available hoist2) (at crate6 depot2) (clear crate6) (on crate6 pallet10)
   goals met: 5 of 12
38. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 102 to 112
   goals met: 5 of 12
39. (unload hoist2 crate7 truck1 depot2)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 36 to 22
   goals met: 5 of 12
40. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 112 to 122
   goals met: 5 of 12
41. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 22 to 20
   goals met: 5 of 12
42. (drop hoist0 crate1 crate0 depot0)
   deleted: (lifting hoist0 crate1) (clear crate0)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate0)
   goals met: 6 of 12
43. (load hoist12 crate4 truck1 depot0)
   deleted: (lifting hoist12 crate4)
   added: (in crate4 truck1) (available hoist12)
   changed: (current_load truck1) from 20 to 48
   goals met: 6 of 12
44. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 122 to 132
   goals met: 6 of 12
45. (unload hoist5 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist5)
   added: (lifting hoist5 crate4)
   changed: (current_load truck1) from 48 to 20
   goals met: 6 of 12
46. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 132 to 142
   goals met: 6 of 12
47. (drop hoist5 crate4 pallet6 distributor2)
   deleted: (lifting hoist5 crate4) (clear pallet6)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 pallet6)
   goals met: 7 of 12
48. (unload hoist9 crate12 truck1 depot2)
   deleted: (in crate12 truck1) (available hoist9)
   added: (lifting hoist9 crate12)
   changed: (current_load truck1) from 20 to 0
   goals met: 7 of 12
49. (drop hoist9 crate12 pallet9 depot2)
   deleted: (lifting hoist9 crate12) (clear pallet9)
   added: (available hoist9) (at crate12 depot2) (clear crate12) (on crate12 pallet9)
   goals met: 8 of 12
50. (lift hoist9 crate8 pallet11 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist9) (on crate8 pallet11)
   added: (lifting hoist9 crate8) (clear pallet11)
   changed: (fuel-cost) from 142 to 143
   goals met: 8 of 12
51. (drop hoist9 crate8 crate12 depot2)
   deleted: (lifting hoist9 crate8) (clear crate12)
   added: (available hoist9) (at crate8 depot2) (clear crate8) (on crate8 crate12)
   goals met: 8 of 12
52. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 143 to 153
   goals met: 8 of 12
53. (drop hoist2 crate7 crate8 depot2)
   deleted: (lifting hoist2 crate7) (clear crate8)
   added: (available hoist2) (at crate7 depot2) (clear crate7) (on crate7 crate8)
   goals met: 9 of 12
54. (load hoist3 crate9 truck1 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck1) (available hoist3)
   changed: (current_load truck1) from 0 to 73
   goals met: 9 of 12
55. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 153 to 163
   goals met: 9 of 12
56. (unload hoist2 crate9 truck1 depot2)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 73 to 0
   goals met: 9 of 12
57. (drop hoist2 crate9 crate6 depot2)
   deleted: (lifting hoist2 crate9) (clear crate6)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 crate6)
   goals met: 9 of 12
58. (lift hoist2 crate7 crate8 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate8)
   added: (lifting hoist2 crate7) (clear crate8)
   changed: (fuel-cost) from 163 to 164
   goals met: 8 of 12
59. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 164 to 174
   goals met: 8 of 12
60. (lift hoist9 crate9 crate6 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist9) (on crate9 crate6)
   added: (lifting hoist9 crate9) (clear crate6)
   changed: (fuel-cost) from 174 to 175
   goals met: 8 of 12
61. (drop hoist2 crate7 crate8 depot2)
   deleted: (lifting hoist2 crate7) (clear crate8)
   added: (available hoist2) (at crate7 depot2) (clear crate7) (on crate7 crate8)
   goals met: 9 of 12
62. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 175 to 185
   goals met: 9 of 12
63. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 185 to 195
   goals met: 9 of 12
64. (lift hoist2 crate3 crate10 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist2) (on crate3 crate10)
   added: (lifting hoist2 crate3) (clear crate10)
   changed: (fuel-cost) from 195 to 196
   goals met: 8 of 12
65. (drop hoist9 crate9 pallet11 depot2)
   deleted: (lifting hoist9 crate9) (clear pallet11)
   added: (available hoist9) (at crate9 depot2) (clear crate9) (on crate9 pallet11)
   goals met: 8 of 12
66. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 196 to 206
   goals met: 8 of 12
67. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 206 to 216
   goals met: 8 of 12
68. (lift hoist9 crate7 crate8 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist9) (on crate7 crate8)
   added: (lifting hoist9 crate7) (clear crate8)
   changed: (fuel-cost) from 216 to 217
   goals met: 7 of 12
69. (drop hoist2 crate3 crate10 depot2)
   deleted: (lifting hoist2 crate3) (clear crate10)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 crate10)
   goals met: 8 of 12
70. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 217 to 227
   goals met: 8 of 12
71. (lift hoist2 crate9 pallet11 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 pallet11)
   added: (lifting hoist2 crate9) (clear pallet11)
   changed: (fuel-cost) from 227 to 228
   goals met: 8 of 12
72. (drop hoist2 crate9 crate6 depot2)
   deleted: (lifting hoist2 crate9) (clear crate6)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 crate6)
   goals met: 8 of 12
73. (lift hoist2 crate8 crate12 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 crate12)
   added: (lifting hoist2 crate8) (clear crate12)
   changed: (fuel-cost) from 228 to 229
   goals met: 8 of 12
74. (drop hoist2 crate8 crate9 depot2)
   deleted: (lifting hoist2 crate8) (clear crate9)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 crate9)
   goals met: 9 of 12
75. (drop hoist9 crate7 crate8 depot2)
   deleted: (lifting hoist9 crate7) (clear crate8)
   added: (available hoist9) (at crate7 depot2) (clear crate7) (on crate7 crate8)
   goals met: 10 of 12
76. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 229 to 239
   goals met: 10 of 12
77. (lift hoist2 crate7 crate8 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate8)
   added: (lifting hoist2 crate7) (clear crate8)
   changed: (fuel-cost) from 239 to 240
   goals met: 9 of 12
78. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 240 to 250
   goals met: 9 of 12
79. (lift hoist9 crate3 crate10 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist9) (on crate3 crate10)
   added: (lifting hoist9 crate3) (clear crate10)
   changed: (fuel-cost) from 250 to 251
   goals met: 8 of 12
80. (load hoist9 crate3 truck0 depot2)
   deleted: (lifting hoist9 crate3)
   added: (in crate3 truck0) (available hoist9)
   changed: (current_load truck0) from 0 to 71
   goals met: 8 of 12
81. (lift hoist9 crate10 crate5 depot2)
   deleted: (at crate10 depot2) (clear crate10) (available hoist9) (on crate10 crate5)
   added: (lifting hoist9 crate10) (clear crate5)
   changed: (fuel-cost) from 251 to 252
   goals met: 8 of 12
82. (load hoist9 crate10 truck0 depot2)
   deleted: (lifting hoist9 crate10)
   added: (in crate10 truck0) (available hoist9)
   changed: (current_load truck0) from 71 to 109
   goals met: 8 of 12
83. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 252 to 262
   goals met: 8 of 12
84. (unload hoist10 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist10)
   added: (lifting hoist10 crate10)
   changed: (current_load truck0) from 109 to 71
   goals met: 8 of 12
85. (drop hoist10 crate10 pallet3 distributor0)
   deleted: (lifting hoist10 crate10) (clear pallet3)
   added: (available hoist10) (at crate10 distributor0) (clear crate10) (on crate10 pallet3)
   goals met: 9 of 12
86. (unload hoist10 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist10)
   added: (lifting hoist10 crate3)
   changed: (current_load truck0) from 71 to 0
   goals met: 9 of 12
87. (drop hoist10 crate3 crate10 distributor0)
   deleted: (lifting hoist10 crate3) (clear crate10)
   added: (available hoist10) (at crate3 distributor0) (clear crate3) (on crate3 crate10)
   goals met: 10 of 12
88. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 262 to 272
   goals met: 10 of 12
89. (lift hoist9 crate8 crate9 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist9) (on crate8 crate9)
   added: (lifting hoist9 crate8) (clear crate9)
   changed: (fuel-cost) from 272 to 273
   goals met: 9 of 12
90. (drop hoist9 crate8 crate12 depot2)
   deleted: (lifting hoist9 crate8) (clear crate12)
   added: (available hoist9) (at crate8 depot2) (clear crate8) (on crate8 crate12)
   goals met: 9 of 12
91. (drop hoist2 crate7 crate8 depot2)
   deleted: (lifting hoist2 crate7) (clear crate8)
   added: (available hoist2) (at crate7 depot2) (clear crate7) (on crate7 crate8)
   goals met: 10 of 12
92. (lift hoist2 crate9 crate6 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 crate6)
   added: (lifting hoist2 crate9) (clear crate6)
   changed: (fuel-cost) from 273 to 274
   goals met: 10 of 12
93. (load hoist2 crate9 truck1 depot2)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 73
   goals met: 10 of 12
94. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 274 to 284
   goals met: 10 of 12
95. (unload hoist12 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist12)
   added: (lifting hoist12 crate9)
   changed: (current_load truck1) from 73 to 0
   goals met: 10 of 12
96. (drop hoist12 crate9 pallet0 depot0)
   deleted: (lifting hoist12 crate9) (clear pallet0)
   added: (available hoist12) (at crate9 depot0) (clear crate9) (on crate9 pallet0)
   goals met: 11 of 12
97. (lift hoist9 crate7 crate8 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist9) (on crate7 crate8)
   added: (lifting hoist9 crate7) (clear crate8)
   changed: (fuel-cost) from 284 to 285
   goals met: 10 of 12
98. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 285 to 295
   goals met: 10 of 12
99. (lift hoist2 crate8 crate12 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 crate12)
   added: (lifting hoist2 crate8) (clear crate12)
   changed: (fuel-cost) from 295 to 296
   goals met: 10 of 12
100. (load hoist2 crate8 truck1 depot2)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 10
   goals met: 10 of 12
101. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 296 to 306
   goals met: 10 of 12
102. (unload hoist11 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist11)
   added: (lifting hoist11 crate8)
   changed: (current_load truck1) from 10 to 0
   goals met: 10 of 12
103. (drop hoist11 crate8 crate9 depot0)
   deleted: (lifting hoist11 crate8) (clear crate9)
   added: (available hoist11) (at crate8 depot0) (clear crate8) (on crate8 crate9)
   goals met: 11 of 12
104. (load hoist9 crate7 truck0 depot2)
   deleted: (lifting hoist9 crate7)
   added: (in crate7 truck0) (available hoist9)
   changed: (current_load truck0) from 0 to 14
   goals met: 11 of 12
105. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 306 to 316
   goals met: 11 of 12
106. (unload hoist11 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist11)
   added: (lifting hoist11 crate7)
   changed: (current_load truck0) from 14 to 0
   goals met: 11 of 12
107. (drop hoist11 crate7 crate8 depot0)
   deleted: (lifting hoist11 crate7) (clear crate8)
   added: (available hoist11) (at crate7 depot0) (clear crate7) (on crate7 crate8)
   goals met: 12 of 12
